package oop_01;

//oop-2

/*
 * 메소드(Method): 클래스 내부에 선언된 함수 - 멤버함수
 * => 필드(멤버변수)를 이용하여 필요한 기능을 제공하기 위한 명령의 모임
 * => 명령(Statement)은 메소드 내부에서만 작성 가능
 * 
 * 함수(Function): 매개변수로 값을 제공받아 계산하여 결과를 반환하는 명령의 모임 - 기능
 * 
 * 메소드 선언하는 방법
 * 형식) 반환형 메소드명(자료형 변수명, 자료형 변수명, ...){
 * 			명령; //메소드를 호출하면 실행되는 명령
 * 		...
 * }
 * 	=> 반환형(ReturnType): 메소드를 호출하여 얻을 수 있는 결과값에 대한 자료형
 *  => void 자료형(무반환형) : 메소드를 호출하여 얻을 수 있는 결과값이 없는 경우 사용하는 자료형
 *  메소드의 () 기호에는 변수를 나열하여 선언 - 매개변수(Parameter - Argument)
 *  => 메소드에 작성된 명령을 실행하기 위해 필요한 값을 메소드 호출시 전달받아 저장하기 위한 변수
 *  => 메소드에 작성된 명령을 실행하기 위한 값이 필요없는 경우 매개변수 생략 가능
 */

public class Method {

}
